Revit 2027 API
ViewSheet.SheetCollectionId Property
 The ID of the sheet collection this sheet is associated with.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId SheetCollectionId { get; set; }
Public Property SheetCollectionId As ElementId
	Get
	Set
public:
property ElementId^ SheetCollectionId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member SheetCollectionId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: Assembly Sheets can't be SheetCollections. -or- When setting this property: The ElementId sheetCollectionId does not correspond to the SheetCollection.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ViewSheet Class
Autodesk.Revit.DB Namespace